W6D3/first_routes_and_controllers/app/controllers/artwork_shares_controller.rb

    def index
        shares = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

    def create
        shared = ArtworkShare.new(params.require(:artwork_shares).permit(:viewer_id, :artwork_id))

        if shared.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 2], ["created_at", "2022-08-25 15:26:31.103025"], ["updated_at", "2022-08-25 15:26:31.103025"]]

    def destroy
        shared = ArtworkShare.find(params[:id])
        shared.destroy
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]