W6D3/first_routes_and_controllers/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "monalisa"], ["image_url", "somelink.com"], ["artist_id", 2], ["created_at", "2022-08-25 14:45:01.139507"], ["updated_at", "2022-08-25 14:45:01.139507"]]
---
    def create
        # debugger
        artwork = Artwork.new(params.require(:artworks).permit(:title, :artist_id, :image_url))
        # artwork.save!
        if artwork.save

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        debugger
        artwork = Artwork.find(params[:id])

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "scream5"], ["image_url", "scream5.com"], ["updated_at", "2022-08-25 14:54:10.657218"], ["id", 4]]
---
    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_param)