W6D3/first_routes_and_controllers/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "some some some some some yeah.right "], ["author_id", 1], ["artwork_id", 4], ["created_at", "2022-08-25 18:24:44.555615"], ["updated_at", "2022-08-25 18:24:44.555615"]]
---
    def create
        comment = Comment.new(comment_params)
        if comment.save