W6D3/first_routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show_user_artworks
        user = User.find(params[:id])