W6D3/first_routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Clide"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        user = User.find_by(username: request.query_string)
        if user
            render json: user
        else
            users = User.all

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Payton"], ["created_at", "2022-08-25 13:52:31.315043"], ["updated_at", "2022-08-25 13:52:31.315043"]]
---
    def create
        user = User.new(params.require(:users).permit(:username))
        # user.save!
        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "clide2"], ["updated_at", "2022-08-25 13:41:02.358516"], ["id", 2]]
---
    def update
        # debugger
        user = User.find(params[:id])
        if user.update(user_param)